In [1]:
# data stuctures
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [3]:
a = pd.Series(['Ali Bernard', 'Edward Ali'], index=['Person', 'Who'])
a

Person    Ali Bernard
Who        Edward Ali
dtype: object

In [4]:
a.dtypes

dtype('O')

In [5]:
a.dtype

dtype('O')

In [6]:
a.size

2

In [7]:
a.equals(s)

False

In [8]:
a.corr(s)

nan

In [9]:
s.to_frame()

        0
0  banana
1      42

In [10]:
df = pd.read_csv("Data/gapminder-FiveYearData.csv")
df.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [11]:
life_expectancy = df['lifeExp']
life_expectancy

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: lifeExp, Length: 1704, dtype: float64

In [12]:
population = df['pop']
population

0        8425333.0
1        9240934.0
2       10267083.0
3       11537966.0
4       13079460.0
           ...
1699     9216418.0
1700    10704340.0
1701    11404948.0
1702    11926563.0
1703    12311143.0
Name: pop, Length: 1704, dtype: float64

In [13]:
pop_life = life_expectancy.append(population)
pop_life

0       2.880100e+01
1       3.033200e+01
2       3.199700e+01
3       3.402000e+01
4       3.608800e+01
            ...
1699    9.216418e+06
1700    1.070434e+07
1701    1.140495e+07
1702    1.192656e+07
1703    1.231114e+07
Length: 3408, dtype: float64

In [14]:
population.corr(life_expectancy)

0.06495536916041665

In [16]:
population.cov(life_expectancy)

89070241.92089173

In [17]:
population == life_expectancy

0       False
1       False
2       False
3       False
4       False
        ...
1699    False
1700    False
1701    False
1702    False
1703    False
Length: 1704, dtype: bool

In [18]:
population.equals(population)

True

In [20]:
population.max()

1318683096.0

In [21]:
life_expectancy.min()

23.599

In [23]:
life_expectancy.mean()

59.474439366197174

In [35]:
life_expectancy.sort_values(ascending=False)

803     82.603
671     82.208
802     82.000
695     81.757
1487    81.701
         ...
1344    30.331
36      30.015
552     30.000
0       28.801
1292    23.599
Name: lifeExp, Length: 1704, dtype: float64

In [32]:
life_expectancy.unique()

array([28.801, 30.332, 31.997, ..., 46.809, 39.989, 43.487])

In [33]:
population.describe()

count    1.704000e+03
mean     2.960121e+07
std      1.061579e+08
min      6.001100e+04
25%      2.793664e+06
50%      7.023596e+06
75%      1.958522e+07
max      1.318683e+09
Name: pop, dtype: float64

In [34]:
life_expectancy.describe()

count    1704.000000
mean       59.474439
std        12.917107
min        23.599000
25%        48.198000
50%        60.712500
75%        70.845500
max        82.603000
Name: lifeExp, dtype: float64

In [36]:
scientist = pd.read_csv("Data/scientists.csv")
scientist

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [37]:
age = scientist['Age']
age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [38]:
ages = age
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [39]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [40]:
ages.mean()

59.125

In [41]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [42]:
scientist['Retired'] = ages > ages.mean()

In [43]:
scientist

,Name,Born,Died,Age,Occupation,Retired
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,False
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,True
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,True
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,True
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,False
5,John Snow,1813-03-15,1858-06-16,45,Physician,False
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,False
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,True

In [44]:
type(ages)

pandas.core.series.Series

In [45]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [46]:
ages.sort_index(ascending=False)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [47]:
rev_ages = ages.sort_index(ascending=False)
rev_ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [48]:
scientist[scientist['Age'] > scientist['Age'].mean()]

                   Name        Born        Died  Age     Occupation  Retired
1        William Gosset  1876-06-13  1937-10-16   61   Statistician     True
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse     True
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist     True
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician     True

In [50]:
scientist[scientist['Retired'] == True]

                   Name        Born        Died  Age     Occupation  Retired
1        William Gosset  1876-06-13  1937-10-16   61   Statistician     True
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse     True
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist     True
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician     True

In [52]:
first_half = scientist.loc[:scientist.shape[0]/2 -1]
first_half

                   Name        Born        Died  Age    Occupation  Retired
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist    False
1        William Gosset  1876-06-13  1937-10-16   61  Statistician     True
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse     True
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist     True

In [55]:
second_half = scientist.loc[scientist.shape[0]/2 -1 :]
second_half

            Name        Born        Died  Age          Occupation  Retired
3    Marie Curie  1867-11-07  1934-07-04   66             Chemist     True
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist    False
5      John Snow  1813-03-15  1858-06-16   45           Physician    False
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist    False
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician     True

In [56]:
scientist * 2

,Name,Born,Died,Age,Occupation,Retired
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist,0
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician,2
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse,2
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist,2
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist,0
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician,0
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist,0
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician,2

In [57]:
born_datetime = scientist['Born']
born_datetime

0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [60]:
scientist.to_csv('scientist_new.csv', index=False)

In [61]:
import xlwt

ModuleNotFoundError: No module named 'xlwt'

In [62]:
scientist.to_excel('sci.xls')

/tmp/ipykernel_6600/2499477224.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  scientist.to_excel('sci.xls')

In [63]:
import openpyxl

In [64]:
scientist.to_excel('sci.xlsx', sheet_name='scientist', index=False)

In [65]:
scientist.to_json('sci_sql.sql')

TypeError: to_sql() missing 1 required positional argument: 'con'